tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Application launcher and productivity software
cask "alfred"
# Cloud storage service
cask "baidunetdisk"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open-source download manager
cask "motrix"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# Free messaging and calling application
cask "wechat"
mas "Snappy", id: 512617038
mas "网易云音乐", id: 944848654
